Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Ans:

In [1]:
import pandas as pd

# Create a Pandas Series
data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)

# Print the series
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it

Ans:.

In [3]:
import pandas as pd

# Create a list variable with 10 elements
list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# Convert the list into a Pandas Series
series = pd.Series(list)

# Print the series
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print t hdata frameme.

Name      age      Gender
Alice     25        Female
Bob       30         Male
Claire    27        Female

In [12]:
import pandas as pd

# Create a dictionary with the data
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

# Create a Pandas DataFrame
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans: In Pandas, both DataFrame and Series are fundamental data structures used for handling and manipulating data.

DataFrame:

A DataFrame is a two-dimensional labeled data structure with rows and columns, similar to a table or spreadsheet.
It is a collection of Pandas Series where each column of the DataFrame represents a Series.
DataFrames are capable of storing heterogeneous data types and can handle missing values efficiently.
DataFrames provide powerful methods and functions for data manipulation, analysis, and visualization.
They are commonly used for data wrangling, exploratory data analysis, and preparing data for statistical analysis or machine learning
 models.
Series:

A Series is a one-dimensional labeled array that can hold data of any data type (e.g., integers, floats, strings, etc.).
It is similar to a single column in a DataFrame but lacks the row index labels.
Series objects are commonly used to represent a single column of data or a single row in a DataFrame.
Series provide a powerful array-like interface with additional features such as index alignment and label-based slicing.
They are useful for performing vectorized operations and mathematical comput
ations on data.
Example:

Consider a scenario where we have data about students' grades in different subjects. We can represent this data using both a DataFrame and Series:

In [13]:
import pandas as pd

# Data for creating DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Math': [85, 90, 78, 88],
    'Science': [75, 85, 80, 92]
}

# Creating DataFrame
df = pd.DataFrame(data)
print("DataFrame:")
print(df)

# Accessing a single column (returns a Series)
math_scores = df['Math']
print("\nSeries (Math Scores):")
print(math_scores)

DataFrame:
      Name  Math  Science
0    Alice    85       75
1      Bob    90       85
2  Charlie    78       80
3    David    88       92

Series (Math Scores):
0    85
1    90
2    78
3    88
Name: Math, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions

Ans: There are some common functions and methods you can use to manipulate data in a pandas data frame, along with example of when you might use them:

1. head() and tail(): these functions are used to view the first or last n rows of the data frame.
  example
 

?

In [14]:
df.head() # View the first 5 rows of the dataframe 
df.tail() # view the last 10 rows of the dataframe

      Name  Math  Science
0    Alice    85       75
1      Bob    90       85
2  Charlie    78       80
3    David    88       92

info():

Provides a concise summary of the DataFrame including column data types and non-null values.
Example:

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Math     4 non-null      int64
 2   Science  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

describe():

Generates descriptive statistics for numeric columns such as count, mean, min, max, and quartiles.
Example:

In [16]:
df.describe()

            Math   Science
count   4.000000   4.00000
mean   85.250000  83.00000
std     5.251984   7.25718
min    78.000000  75.00000
25%    83.250000  78.75000
50%    86.500000  82.50000
75%    88.500000  86.75000
max    90.000000  92.00000

shape:

Returns a tuple representing the dimensions (rows, columns) of the DataFrame.
Example:

In [18]:
df.shape

(4, 3)

columns and index:

Returns the column names and index labels of the DataFrame, respectively.
Example:

In [19]:
df.columns  
df.index

RangeIndex(start=0, stop=4, step=1)

dropna():

Removes rows or columns with missing values (NaN).
Example:

In [20]:
df.dropna()

      Name  Math  Science
0    Alice    85       75
1      Bob    90       85
2  Charlie    78       80
3    David    88       92

fillna():

Fills missing values with a specified value or method.
Example:

In [21]:
df.fillna(0)  # Fill missing values with 0

      Name  Math  Science
0    Alice    85       75
1      Bob    90       85
2  Charlie    78       80
3    David    88       92

drop_duplicates():

Removes duplicate rows from the DataFrame.
Example:

In [22]:
df.drop_duplicates()

      Name  Math  Science
0    Alice    85       75
1      Bob    90       85
2  Charlie    78       80
3    David    88       92

sort_values():

Sorts the DataFrame by one or more columnsle:

pivot_table():

Creates a pivot table from DataFrame datale:

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans: Among Series, DataFrame, and Panel, only DataFrame is mutable in nature.

Series: Series is immutable. Once created, you cannot modify the values or the index of a Series directly. You would need to create a new Series if you want to change its values or index.

DataFrame: DataFrame is mutable. You can modify the values, add or remove columns, and change the index or column labels of a DataFrame after it has been created.

Panel: Panel is deprecated as of Pandas version 0.25.0. It was a three-dimensional data structure representing data in the form of items (axis 0), major_axis (axis 1), and minor_axis (axis 2). Since it is no longer actively developed and is considered deprecated, it is not relevant to discuss its mutability.

In [25]:
import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}
df = pd.DataFrame(data)

# Modify values in the DataFrame
df.at[0, 'Age'] = 26  # Change Alice's age
df.loc[1, 'Age'] = 31  # Change Bob's age

# Add a new column
df['City'] = ['New York', 'Los Angeles', 'Chicago']

# Remove a column
df.drop(columns=['Age'], inplace=True)

print(df)

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

Q7. Create a DataFrame using multiple Series. Explain with an example.

ans: we can create a DataFrame using multiple Series by passing the Series objects as a dictionary to the pd.DataFrame() constructor. Each Series will correspond to a column in the DataFrame, and their indices will align to form the DataFrame's index.

Here's an example:

In [26]:
import pandas as pd

# Creating Series objects
name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 35])
city_series = pd.Series(['New York', 'Los Angeles', 'Chicago'])

# Creating DataFrame using multiple Series
df = pd.DataFrame({
    'Name': name_series,
    'Age': age_series,
    'City': city_series
})

# Printing the DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In this example:

Three Series objects (name_series, age_series, and city_series) are created with data for 'Name', 'Age', and 'City' respectively.
These Series objects are passed as a dictionary to the pd.DataFrame() constructor to create the DataFrame df.
Each Series becomes a column in the DataFrame, and their indices align to form the DataFrame's index.
Finally, the DataFrame is printed, showing the data in tabular form with columns for 'Name', 'Age', and 'City'.